app/views/books/index.html.erb

SELECT "books".* FROM "books" WHERE (name ILIKE '%alg%')
---

                  <%elsif current_user.books.where(isbn: book.isbn).count.odd? %>