app/controllers/admins_controller.rb

INSERT INTO "admins" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "guru"], ["email", "guru1989@gmail.com"], ["password", "nosiop"], ["created_at", "2015-09-27 15:14:03.187294"], ["updated_at", "2015-09-27 15:14:03.187294"]]
---
  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save

UPDATE "admins" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["name", "super"], ["email", "super@a.com"], ["updated_at", "2015-09-27 15:40:33.007903"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @admin.update(admin_params)

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 5]]
---
  def destroy
    if @admin.destroy