app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (name ILIKE '%alg%')
---
  def index
    @books = Book.all

INSERT INTO "books" ("isbn", "name", "authors", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["isbn", 1234], ["name", "Algos"], ["authors", "Rivest"], ["created_at", "2015-10-08 00:06:50.066090"], ["updated_at", "2015-10-08 00:06:50.066090"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "description" = ?, "updated_at" = ? WHERE "books"."isbn" = ?  [["description", "finally!!!"], ["updated_at", "2015-10-08 14:04:53.099548"], ["isbn", 3545]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."isbn" = ? LIMIT 1  [["isbn", 1234]]
---
    def set_book
      @book = Book.find(params[:isbn])