app/controllers/book_transactions_controller.rb

  def create2
    book = Book.find(return_params[:book_id])
    if(book.nil?)
      redirect_to root_path,notice: "Book not found"
      return
    end
    owner = book.current_owner
    unless (owner.nil?)
      if(owner == current_user or is_admin?)
        @book_transaction = BookTransaction.new(book_id:book.id,member_id:book.current_owner.id)
        respond_to do |format|
          if @book_transaction.save
            @book_transaction.book.update(status: "Available")
---
INSERT INTO "book_transactions" ("book_id", "member_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 1], ["member_id", 14], ["created_at", "2015-10-08 01:00:01.560841"], ["updated_at", "2015-10-08 01:00:01.560841"]]
UPDATE "books" SET "status" = ?, "updated_at" = ? WHERE "books"."isbn" = ?  [["status", "Available"], ["updated_at", "2015-10-08 01:00:01.588967"], ["isbn", 1]]

  def create1
    @book_transaction = BookTransaction.new(book_transaction_params)
    member = @book_transaction.member
    book = @book_transaction.book
    if member.nil?
      redirect_to checkout_path(book), notice: 'Member does not exist'
      return
    end
    if book.current_owner.nil?
      respond_to do |format|
        if @book_transaction.save
---
INSERT INTO "book_transactions" ("book_id", "member_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 1], ["member_id", 14], ["created_at", "2015-10-08 00:59:53.486855"], ["updated_at", "2015-10-08 00:59:53.486855"]]

  def set_book_transaction
    @book_transaction = BookTransaction.find(params[:id])
---
SELECT "book_transactions".* FROM "book_transactions" WHERE "book_transactions"."book_id" = ?  [["book_id", 1]]