app/controllers/members_controller.rb

INSERT INTO "members" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "guru"], ["email", "guru1989@gmail.com"], ["password", "nosiop"], ["created_at", "2015-10-08 00:24:09.333840"], ["updated_at", "2015-10-08 00:24:09.333840"]]
---
  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save

UPDATE "members" SET "name" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["name", "gurudatt"], ["updated_at", "2015-10-08 03:15:13.637557"], ["id", 14]]
---
  def update
    respond_to do |format|
      if @member.update(member_params)

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 14]]
---
    def set_member
      @member = Member.find(params[:id])