app/controllers/sessions_controller.rb

  def create
    user = nil
    admin = Admin.find_by(email: params[:session][:email].downcase)
    member = Member.find_by(email: params[:session][:email].downcase)
---
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT 1  [["email", "admin@admin.com"]]
SELECT  "members".* FROM "members" WHERE "members"."email" = ? LIMIT 1  [["email", "admin@admin.com"]]